In [43]:
import numpy as np
import pandas as pd

In [44]:
sozluk1 = {"Isim": ["Ahmet","Mehmet","Zeynep","Atıl"],
           "Spor": ["Koşu","Yüzme","Koşu","Basketbol"],
           "Kalori": [100,200,300,400]
          }

In [45]:
dataFrame1 = pd.DataFrame(sozluk1,index = [0,1,2,3])

In [46]:
dataFrame1

     Isim       Spor  Kalori
0   Ahmet       Koşu     100
1  Mehmet      Yüzme     200
2  Zeynep       Koşu     300
3    Atıl  Basketbol     400

In [34]:
sozluk2 = {"Isim": ["Osman","Levent","Atlas","Fatma"],
           "Spor": ["Koşu","Yüzme","Koşu","Basketbol"],
           "Kalori": [200,100,50,300]
          }

In [35]:
dataFrame2 = pd.DataFrame(sozluk2,index = [4,5,6,7])

In [36]:
sozluk3 = {"Isim": ["Ayşe","Fatih","Duygu","Nur"],
           "Spor": ["Koşu","Yüzme","Badminton","Tenis"],
           "Kalori": [300,400,600,500]
          }

In [37]:
dataFrame3 = pd.DataFrame(sozluk3,index = [8,9,10,11])

In [38]:
dataFrame3

     Isim       Spor  Kalori
8    Ayşe       Koşu     300
9   Fatih      Yüzme     400
10  Duygu  Badminton     600
11    Nur      Tenis     500

# concatenation

In [39]:
pd.concat([dataFrame1,dataFrame2,dataFrame3],axis = 0)

      Isim       Spor  Kalori
0    Ahmet       Koşu     100
1   Mehmet      Yüzme     200
2   Zeynep       Koşu     300
3     Atıl  Basketbol     400
4    Osman       Koşu     200
5   Levent      Yüzme     100
6    Atlas       Koşu      50
7    Fatma  Basketbol     300
8     Ayşe       Koşu     300
9    Fatih      Yüzme     400
10   Duygu  Badminton     600
11     Nur      Tenis     500

## merge

In [40]:
mergeSozluk1 = {"Isim": ["Ayşe","Fatih","Duygu","Nur"],
                 "Spor": ["Yüzme","Koşu","Basketbol","Futbol"]  
               }

In [41]:
mergeDataFrame1 = pd.DataFrame(mergeSozluk1)

In [42]:
mergeDataFrame1

    Isim       Spor
0   Ayşe      Yüzme
1  Fatih       Koşu
2  Duygu  Basketbol
3    Nur     Futbol

In [14]:
mergeSozluk2 = {"Isim": ["Ayşe","Fatih","Duygu","Nur"],
                 "Kalori": [100,50,300,250]  
               }

In [15]:
mergeDataFrame2 = pd.DataFrame(mergeSozluk2)

In [16]:
mergeDataFrame2

    Isim  Kalori
0   Ayşe     100
1  Fatih      50
2  Duygu     300
3    Nur     250

In [17]:
pd.merge(mergeDataFrame1,mergeDataFrame2,on="Isim")

    Isim       Spor  Kalori
0   Ayşe      Yüzme     100
1  Fatih       Koşu      50
2  Duygu  Basketbol     300
3    Nur     Futbol     250

In [18]:
maasSozluk = { "Isim": ["Atıl","Ahmet","Mehmet","Zeynep"],
               "Departman": ["Yazılım","Finans","Pazarlama","Yazılım"],
               "Maas": [300,100,200,500]
             }

In [19]:
maasDataFrame = pd.DataFrame(maasSozluk)

In [20]:
maasDataFrame

     Isim  Departman  Maas
0    Atıl    Yazılım   300
1   Ahmet     Finans   100
2  Mehmet  Pazarlama   200
3  Zeynep    Yazılım   500

In [21]:
maasDataFrame["Departman"].unique()

array(['Yazılım', 'Finans', 'Pazarlama'], dtype=object)

In [22]:
maasDataFrame["Departman"].nunique() #kac farklı departman var

3

In [23]:
maasDataFrame["Departman"].value_counts()

Yazılım      2
Finans       1
Pazarlama    1
Name: Departman, dtype: int64

In [24]:
def bruttenNete(maas):
    return maas * 0.66

In [25]:
maasDataFrame["Maas"].apply(bruttenNete)

0    198.0
1     66.0
2    132.0
3    330.0
Name: Maas, dtype: float64

In [26]:
maasDataFrame.isnull()

    Isim  Departman   Maas
0  False      False  False
1  False      False  False
2  False      False  False
3  False      False  False

In [27]:
yeniBirVeri =   {"Karakter Sınıfı":  ["SouthPark","SouthPark","Simpson","Simpson","Simpson"],
                 "Karakter Ismi" : ["Cartman","Kenny","Homer","Bart","Bart"],
                  "Karakter Yas" : [9,10,50,20,10]
                }

In [28]:
karakterDF  = pd.DataFrame(yeniBirVeri)

In [29]:
karakterDF

  Karakter Sınıfı Karakter Ismi  Karakter Yas
0       SouthPark       Cartman             9
1       SouthPark         Kenny            10
2         Simpson         Homer            50
3         Simpson          Bart            20
4         Simpson          Bart            10

In [61]:
karakterDF.pivot_table (values = "Karakter Yas", index = ["Karakter Sınıfı","Karakter Ismi"],aggfunc = np.sum )
#aggfunc , yas ortalamasını vermeden toplar --bart icin

                               Karakter Yas
Karakter Sınıfı Karakter Ismi
Simpson         Bart                     30
                Homer                    50
SouthPark       Cartman                   9
                Kenny                    10

In [ ]:
=